Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The complete source code is available https://github.com/cescoffier/quarkus-magic-control/tree/main/no-magic-example[here]. Don't expect much more; the application had only one Java class, but let's look into it.
ja_jp: 完全なソースコードは link:https://github.com/cescoffier/quarkus-magic-control/tree/main/no-magic-example[ここ]にあります。アプリケーションにはJavaクラスが1つしかありませんが、それを調べてみましょう。

source: The completed greeter application from the xref:getting-started.adoc[Getting Started Guide]
ja_jp: link:getting-started.html[入門ガイド]に掲載されている、完了済のGreeterアプリケーション

source: The completed solution is located in the `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[directory].
ja_jp: ソリューションは `security-jwt-quickstart` link:{quickstarts-tree-url}/security-jwt-quickstart[ディレクトリー] にあります。

source: The component model of Quarkus is built on top xref:cdi-reference.adoc[CDI]. Therefore, Quarkus provides `QuarkusComponentTestExtension` - a JUnit extension that makes it easy to test the components/CDI beans and mock their dependencies. Unlike `@QuarkusTest` this extension does not start a full Quarkus application but merely the CDI container and the configuration service. You can find more details in the <<lifecycle>> section.
ja_jp: Quarkus のコンポーネントモデルは xref:cdi-reference.adoc[CDI] 上に構築されています。 そのため、Quarkus は、コンポーネント/CDI Bean を簡単にテストし、それらの依存関係をモック化できる JUnit エクステンションである `QuarkusComponentTestExtension` を提供します。 `@QuarkusTest` とは異なり、このエクステンションは完全な Quarkus アプリケーションを起動せず、CDI コンテナーと設定サービスのみを起動します。 詳細は、<<lifecycle>> セクションを参照してください。

source: The component should be named in the following format: Qwc (stands for Quarkus Web Component), then Extension Name, then Page Title, all concatenated with Camel Case. This will also match the file name format as described earlier. The component should also extend `LitComponent`.
ja_jp: コンポーネントの名前は、Qwc (Quarkus Web Component の略)、エクステンション名、ページタイトルの順に、すべて Camel Case で連結した形式にする必要があります。これは、前述のファイル名の形式とも一致します。コンポーネントは `LitComponent` を拡張する必要もあります。

source: The compression level goes from 1 to 10:
ja_jp: 圧縮レベルは1から10まであります。

source: The concept of _bindings source_ is a build-time friendly equivalent of `InterceptionFactory.configure()`.
ja_jp: _bindings source_ の概念は、ビルド時に使いやすい `InterceptionFactory.configure()` と同等です。

source: The condition class can inject <<configuration,configuration mappings>> as long as they belong to a build-time phase. Run time configuration is not available for condition classes.
ja_jp: 条件クラスは、ビルドタイムフェーズに属している限り <<configuration,configuration mappings>> を注入できます。ランタイム設定は、条件クラスでは使用できません。

source: The condition class can inject <<configuration-roots,configuration roots>> as long as they belong to a build-time phase. Run time configuration is not available for condition classes.
ja_jp: 条件クラスは、ビルドタイムフェーズに属している限り <<configuration-roots,設定ルート>> を注入できます。ランタイム設定は、条件クラスでは使用できません。

source: The condition class may also inject a value of type `io.quarkus.runtime.LaunchMode`. Constructor parameter and field injection is supported.
ja_jp: 条件クラスは、タイプ `io.quarkus.runtime.LaunchMode` の値を注入することもできます。コンストラクターパラメーターとフィールドインジェクションがサポートされています。

source: The condition in a ternary operator evaluates to `true` if the value is not considered `falsy` as described in <<if_section>>.
ja_jp: <<if_section>> で説明したように、三項演算子の条件は値が `falsy` とみなされない場合は `true` と評価されます。

source: The condition in a ternary operator evaluates to `true` if the value is not considered `falsy` as described in the <<if_section>>.
ja_jp: 三項演算子の条件は、 link:#if_section[[if_section]] で説明したように、値が `falsy` とみなされない場合は `true` と評価されます。

source: The condition in a ternary operator evaluates to `true` if the value is not considered `falsy` as described in xref:if_section[If Section].
ja_jp: 三項演算子の条件は、 xref:if_section[Ifセクション] で説明したように、値が `falsy` とみなされない場合、 `true` と評価されます。

source: The condition when the synthetic bean should be inactive.
ja_jp: 合成 Bean が非アクティブになる条件。

source: The condition which triggers activation of an extension is configured in the extension's `META-INF/quarkus-extension.properties`, which is included in the runtime artifact of the extension. Extension developers can add the following configuration to express the condition which would have to be satisfied for the extension to be activated:
ja_jp: エクステンションのアクティベーションをトリガーする条件は、エクステンションの `META-INF/quarkus-extension.properties` で設定されます。これは、エクステンションのランタイムアーティファクトに含まれています。エクステンションの開発者は、次の設定を追加して、エクステンションのアクティブ化で満たす必要がある条件を表現できます。

source: The condition which triggers activation of an extension is configured in the extension's descriptor, which is included into the runtime artifact of the extension as `META-INF/quarkus-extension.properties`. Given that extension descriptor is generated by the Quarkus plugin at extension build time, extension developers can add the following configuration to express the condition which would have to be satisfied for the extension to be activated:
ja_jp: エクステンションの有効化のトリガーとなる条件は、エクステンションの記述子で設定され、この記述子はエクステンションのランタイムアーティファクトに `META-INF/quarkus-extension.properties` として含まれています。エクステンションの記述子は、エクステンションのビルド時にQuarkusプラグインによって生成されるため、エクステンションの開発者は以下の設定を追加して、エクステンションをアクティブにするために満たさなければならない条件を表現することができます。

source: The config property `myMethod.delay.expr` is used to set the delay.
ja_jp: 遅延の設定には、configプロパティー `myMethod.delay.expr` を使用します。

source: The config property is injected when the bean is created and the value is fixed.
ja_jp: 設定プロパティはBeanの生成時に注入され、値は固定されます。

source: The configuration `quarkus.config.profile.parent` must be placed in the main `application.properties` file, passed as a system property, or passed as an environment variable. It does not work when the configuration is placed in the profile aware files.
ja_jp: 設定 `quarkus.config.profile.parent` は、メインの `application.properties` ファイルに配置するか、システム プロパティとして渡すか、環境変数として渡す必要があります。 設定がプロファイル対応ファイルに配置されている場合は機能しません。

source: The configuration above enables two registries: `registry.acme.org` and `registry.quarkus.io`. The order of the registries is actually significant. When the Quarkus dev tools are looking for extensions on user's request, the registries will be searched in the order they are configured, i.e. from the top to the bottom of the list. Extensions and platforms found first will appear as the preferred ones to the user.
ja_jp: 上記の設定では、 `registry.acme.org` と `registry.quarkus.io` の2つのレジストリが有効になります。レジストリの順序は実際に重要です。Quarkusの開発ツールがユーザーの要求に応じてエクステンションを探す場合、レジストリは設定された順、つまりリストの上から下に向かって検索されます。最初に見つかったエクステンションやプラットフォームは、ユーザーが好むものとして扱われます。

source: The configuration attributes we care most about are:
ja_jp: 私たちが最も気にしている設定属性は:

source: The configuration in the `application.properties` looks like this:
ja_jp: `application.properties` の設定は以下のようになります。

source: The configuration in xml of the 'magazine' (yaml and json are also supported)
ja_jp: 'magazine' のxmlでの設定（yaml、jsonもサポートされています）

source: The configuration is an important part of each extension and therefore needs to be properly documented. Each configuration property should have a proper Javadoc comment.
ja_jp: 設定は各エクステンションの重要な部分であるため、適切に文書化される必要があります。各設定プロパティには、適切なJavadocコメントを付ける必要があります。

source: The configuration is based on the official https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer Configuration]. If you are looking for more details about the different configuration options, please take a look at this documentation,
ja_jp: この設定は、 link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer] の公式設定に基づいています。異なる設定オプションについての詳細をお探しの方は、こちらのドキュメントをご覧ください。

source: The configuration is located in the `application.properties` file.
ja_jp: 設定は、 `application.properties` ファイルにあります。

source: The configuration keys are structured as follows:
ja_jp: 設定キーは次のように構成されています。

source: The configuration looks much simpler now:
ja_jp: 設定は非常にシンプルになりました。

source: The configuration namespace has changed to `quarkus.otel.*`. We recommend switching to the new configuration properties, even though the old ones are still supported for now.
ja_jp: 設定ネームスペースは、 `quarkus.otel.*` に変更されました。古い設定プロパティは、今のところまだサポートされていますが、新しい設定プロパティに切り替えることをお勧めします。

source: The configuration of such providers can become complex, very technical and difficult to understand.
ja_jp: このようなプロバイダーの設定は、複雑で非常に技術的になり、理解が困難になる可能性があります。

source: The configuration of the 'magazine' cache as a plain text property
ja_jp: プレーンテキストプロパティとして 'magazine' キャッシュの設定

source: The configuration of the created Kafka broker can be customized using `@ResourceArg`, for example:
ja_jp: 作成された Kafka ブローカーの設定は、 `@ResourceArg` を使用してカスタマイズすることができます。以下に例を示します。

source: The configuration of the managed Vert.x instance can be provided using the `application.properties` file, but also using _special beans_. CDI beans exposing the `io.quarkus.vertx.VertxOptionsCustomizer` interface can be used to customize the Vert.x configuration. For example, the following customizer change the `tmp` base directory:
ja_jp: マネージド Vert.x インスタンスの設定は、 `application.properties` ファイルを使用して提供できますが、_special bean_ を使用することもできます。 `io.quarkus.vertx.VertxOptionsCustomizer` インターフェイスを公開する CDI Bean を使用して、Vert.x 設定をカスタマイズできます。 たとえば、次のカスタマイザは `tmp` ベース ディレクトリを変更します。

source: The configuration of the quarkus-maven-plugin will be simpler:
ja_jp: quarkus-maven-pluginの設定はシンプルになるでしょう:

source: The configuration path is required to exist with a valid configuration value or the mapping will fail.
ja_jp: 設定パスには有効な設定値が存在する必要があります。存在しない場合、マッピングは失敗します。

source: The configuration properties `quarkus.test.include-pattern` and `quarkus.test.exclude-pattern` can be used to select which tests to run. They are regular expressions matched against the fully qualified class name of the test class. If `include-patterns` is configured, `exclude-patterns` is ignored.
ja_jp: `quarkus.test.include-pattern` と `quarkus.test.exclude-pattern` の設定プロパティを使用して、実行するテストを選択することができます。 これらはテストクラスの完全修飾クラス名とマッチする正規表現です。 `include-patterns` が設定されている場合、 `exclude-patterns` は無視されます。

source: The configuration properties are structured as follows:
ja_jp: 設定プロパティは以下のような構造になっています：

source: The configuration properties listed here allow you to override such defaults, and customize and tune various aspects.
ja_jp: ここに記載されている設定プロパティーでは、このようなデフォルトを上書きしたり、様々な面をカスタマイズしたり調整したりすることができます。

source: The configuration properties listed in <<configuration-reference>> allow you to override such defaults, and customize and tune various aspects.
ja_jp: <<configuration-reference>> にリストされている設定プロパティーを使用すると、このようなデフォルト値を上書きしたり、さまざまな側面をカスタマイズおよび調整したりできます。

source: The configuration property `my.secret` will be added to `application.properties` with the value `1234` encrypted and encoded in *Base64* and an expression `${aes-gcm-nopadding::}`, with the required secret handler to decrypt the value. If it doesn't exist, an encryption key is also generated and set into `smallrye.config.secret-handler.aes-gcm-nopadding.encryption-key`.
ja_jp: 設定プロパティ `my.secret` は、値 `1234` が暗号化され、 *Base64* でエンコードされ、値を復号化するために必要なシークレットハンドラを持つ式 `${aes-gcm-nopadding::}` とともに `application.properties` に追加されます。 存在しない場合は、暗号化キーも生成され、 `smallrye.config.secret-handler.aes-gcm-nopadding.encryption-key` に設定されます。

source: The configuration property `quarkus.http.enable-compression` has no effect on compression support of RESTEasy Classic endpoints.
ja_jp: 設定プロパティー `quarkus.http.enable-compression` は、RESTEasy Classic エンドポイントの圧縮サポートに影響を与えません。

source: The configuration property needs to specify an additional name to act as the key. In this case the `form()` `Map` will contain three elements with the keys `login-page`, `error-page` and `landing-page`.
ja_jp: 設定プロパティでは、キーとして機能する追加の名前を指定する必要があります。この場合、 `form()` `Map` には、 `login-page`, `error-page`, `landing-page` というキーを持つ3つの要素が含まれます。

source: The configuration should look like this:
ja_jp: 設定は以下のようになります。

source: The configuration shown above is applied to all the outgoing messages. Sometimes, you want to customize the value for each message individually. To achieve this, you can also attach `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` to your message to customize the id, source, type and subject for each message:
ja_jp: 上記の設定は、すべての送信メッセージに適用されます。場合によっては、各メッセージの値を個別にカスタマイズしたいこともあるでしょう。これを実現するには、メッセージに `io.smallrye.reactive.messaging.ce.OutgoingCloudEventMetadata` を添付して、各メッセージの id、ソース、タイプ、件名をカスタマイズすることもできます:

source: The configuration value is automatically converted to the member type
ja_jp: 設定値は自動的にメンバー型に変換されます。

source: The configuration with the programmatic set up would look like this:
ja_jp: プログラムによるセットアップでの設定は次のようになります。

source: The configured image must be _compatible_ with the `activemq-artemis-broker` one. The container is launched with the `AMQ_USER`, `AMQ_PASSWORD` and `AMQ_EXTRA_ARGS` environment variables. The ports 5672 and 8161 (web console) are exposed.
ja_jp: 設定されたイメージは、 `activemq-artemis-broker` のものと _互換性が_ なければなりません。 コンテナは、 `AMQ_USER` 、 `AMQ_PASSWORD` 、 `AMQ_EXTRA_ARGS` の環境変数で起動します。 ポート 5672 と 8161（ウェブ・コンソール）が公開されます。

source: The configured path is resolved into a valid route.
ja_jp: 設定されたパスが有効なルートに解決されます。

source: The connection can be used to send messages to the client, access the path parameters, broadcast messages to all connected clients, etc.
ja_jp: 接続を使用して、クライアントにメッセージを送信したり、パスパラメーターにアクセスしたり、接続されているすべてのクライアントにメッセージをブロードキャストしたりできます。

source: The connection can be used to send messages to the client, access the path parameters, etc.
ja_jp: この接続を使用して、クライアントにメッセージを送信したり、パスパラメーターにアクセスしたりできます。

source: The connection string, given on the admin console, such as `demo-c--bjsv-ldd-cvavkc-a.bf2.kafka.rhcloud.com:443`
ja_jp: 管理コンソールに指定されている接続文字列 (例: `demo-c--bjsv-ldd-cvavkc-a.bf2.kafka.rhcloud.com:443`)

source: The connection timeout in milliseconds Type: _int_
ja_jp: ミリ秒単位の接続タイムアウト タイプ: _int_

source: The connection url is configured with the `quarkus.redis.hosts` (or `quarkus.redis.<name>.hosts`) as follows:
ja_jp: 接続 URL は、以下のように `quarkus.redis.hosts` (または `quarkus.redis.<name>.hosts`) で設定されます。

source: The connector also supports the _structured_ mode. You can write structured Cloud Events by setting the `cloud-events-mode` attribute to `structured`. It only supports JSON at the moment. The written record gets its `content-type` header set to `application/cloudevents+json; charset=UTF-8`, which allows the receiver to understand that it's a structured Cloud Event.
ja_jp: コネクタは _構造化_ モードもサポートしています。 `cloud-events-mode` 属性を `structured` に設定することで、構造化された Cloud Events を書くことができます。現時点では JSON のみサポートしています。書き込まれたレコードの `content-type` ヘッダーは `application/cloudevents+json; charset=UTF-8` に設定され、これにより受信者はそれが構造化されたクラウドイベントであることを理解することができます。

source: The connector converts incoming AMQP Messages into Reactive Messaging `Message<T>` instances. `T` depends on the _body_ of the received AMQP Message.
ja_jp: このコネクターは、受信した AMQP Messages をリアクティブメッセージング `Message<T>` インスタンスに変換します。T` は受信した AMQP メッセージの _body_ に依存します。

source: The connector converts incoming RabbitMQ Messages into Reactive Messaging `Message<T>` instances. The payload type `T` depends on the value of the RabbitMQ received message Envelope `content_type` and `content_encoding` properties.
ja_jp: コネクターは、受信 RabbitMQ メッセージをリアクティブメッセージング `Message<T>` インスタンスに変換します。ペイロードタイプ `T` は、RabbitMQ 受信メッセージエンベロープ `content_type` および `content_encoding` プロパティーの値によって異なります。

source: The connector for this client endpoint is used as follows:
ja_jp: このクライアントエンドポイントのコネクターは次のように使用されます。

source: The connector only sends that amount of messages concurrently. No other messages will be sent until at least one in-flight message gets acknowledged by the broker. Then, the connector writes a new message to Kafka when one of the broker’s in-flight messages get acknowledged. Be sure to configure Kafka’s `batch.size` and `linger.ms` accordingly.
ja_jp: コネクターは、その量のメッセージのみを同時に送信します。少なくとも 1 つのインフライトメッセージがブローカーによって確認応答されるまで、他のメッセージは送信されません。次に、ブローカーのインフライトメッセージの 1 つが確認応答されると、コネクターは Kafka に新しいメッセージを書き込みます。それに応じて、Kafka の `batch.size` と `linger.ms` を設定してください。

source: The connector only sends that amount of messages concurrently. No other messages will be sent until at least one pending message gets acknowledged by the broker. Then, the connector writes a new message to Pulsar when one of the broker’s pending messages get acknowledged.
ja_jp: コネクターは、その数のメッセージのみを同時に送信します。 少なくとも 1 つの保留メッセージがブローカーによって確認応答されるまで、他のメッセージは送信されません。 次に、ブローカーの保留メッセージの 1 つが確認応答されると、コネクターが Pulsar に新しいメッセージを書き込みます。

source: The connector uses the Vert.x AMQP client underneath. More details about this client can be found in the https://vertx.io/docs/vertx-amqp-client/java/[Vert.x website].
ja_jp: コネクターは、その下にある Vert.xAMQP クライアントを使用します。このクライアントの詳細については、 https://vertx.io/docs/vertx-amqp-client/java/[Vert.x website] を参照してください。

source: The connector uses the Vert.x RabbitMQ client underneath. More details about this client can be found in the https://vertx.io/docs/vertx-rabbitmq-client/java/[Vert.x website].
ja_jp: コネクターは、その下にある Vert.x RabbitMQ クライアントを使用します。このクライアントの詳細については、 https://vertx.io/docs/vertx-rabbitmq-client/java/[Vert.x Web サイト] を参照してください。

source: The connector uses this strategy by default if you explicitly enabled Kafka's auto-commit (with the `enable.auto.commit` attribute set to `true`). In this case, the connector ignores acknowledgment and won't commit the offsets. The Kafka consumer commits the offset periodically when polling batches, as described above. This strategy works well if the message processing is synchronous and failures handled gracefully.
ja_jp: Kafka の自動コミットを明示的に有効にした場合 ( `enable.auto.commit` 属性を `true` に設定した場合)、コネクタはデフォルトでこのストラテジーを使用します。この場合、コネクタは確認応答を無視してオフセットをコミットしません。Kafka コンシューマは、前述のように、バッチをポーリングする際に定期的にオフセットをコミットします。この方法は、メッセージ処理が同期的で、失敗があっても潔く処理される場合に有効です。

source: The console displays output similar to this:
ja_jp: コンソールに次のような出力が表示されます。

source: The console log handler is enabled by default, and it directs all log events to the application's console, usually the system's `stdout`.
ja_jp: コンソールログハンドラーはデフォルトで有効になっており、すべてのログイベントをアプリケーションのコンソール（通常はシステムの `stdout` ）に送ります。

source: The console log handler is enabled by default. It outputs all log events to the console of your application (typically to the system's `stdout`).
ja_jp: コンソールログハンドラーはデフォルトで有効になっています。これはすべてのログイベントをアプリケーションのコンソールに出力します (通常はシステムの `stdout` )。

source: The constructor resolution process follows this order:
ja_jp: コンストラクターの解決プロセスは、次の順序に従います。

source: The consumed / populated Kafka topic. If neither this property nor the `topics` properties are set, the channel name is used Type: _string_
ja_jp: 消費/投入されるKafkaトピック。このプロパティも `topics` のプロパティも設定されていない場合は、チャネル名が使用されます。 Type: _string_

source: The consumed / populated Pulsar topic. If not set, the channel name is used
ja_jp: 消費された／入力されたパルサー・トピック。設定されていない場合、チャンネル名が使用されます

source: The consumed `KafkaRecordBatch` message is passed to the `KafkaTransactions#withTransactionAndAck` in order to handle the offset commits and message acks.
ja_jp: 消費された `KafkaRecordBatch` メッセージは、オフセットコミットとメッセージ ack を処理するために、 `KafkaTransactions#withTransactionAndAck` に渡されます。

source: The consumed message is passed to the `KafkaTransactions#withTransactionAndAck` in order to handle the offset commits and message acks.
ja_jp: 消費されたメッセージは、オフセットコミットとメッセージ ack を処理するために、 `KafkaTransactions#withTransactionAndAck` に渡されます。

source: The consumer `client.id` is configured according to the number of clients to create using `mp.messaging.incoming.[channel].partitions` property.
ja_jp: コンシューマーの `client.id` は、 `mp.messaging.incoming.[channel].partitions` プロパティーを使用して作成するクライアントの数に応じて設定されます。

source: The container analyses the field annotations to build a bean metadata. The _type_ is used to build the set of bean types. In this case, it will be `double` and `java.lang.Object`. No scope annotation is declared and so it's defaulted to `@Dependent`.
ja_jp: コンテナーは,フィールドアノテーションを分析して,Beanのメタデータを構築します。 _型_ は,Beanの型の集合を構築するために使用されます。この場合、 `double` と `java.lang.Object` .スコープアノテーションは宣言されていないので、デフォルトは `@Dependent` になります。

source: The container analyses the method annotations to build a bean metadata. The _return type_ is used to build the set of bean types. In this case, it will be `List<String>`, `Collection<String>`, `Iterable<String>` and `java.lang.Object`. No scope annotation is declared and so it's defaulted to `@Dependent`.
ja_jp: コンテナーはメソッドアノテーションを分析して Bean メタデータを構築します。 _戻り値の型_ は、Bean 型のセットを構築するために使用されます。 この場合はリスト<String>`、 `コレクション<String>`、 `反復可能<String>` および `java.lang.Object` です。 スコープアノテーションが宣言されていないため、デフォルトで `@Dependent` になります。

source: The container attempts to <<cdi-reference.adoc#remove_unused_beans,remove all unused beans>> during the build by default. This optimization allows for _framework-level dead code elimination_. In a few special cases, it's not possible to correctly identify an unused bean. In particular, Quarkus is not able to detect the usage of the `CDI.current()` static method yet. Extensions can eliminate possible false positives by producing an `UnremovableBeanBuildItem`.
ja_jp: コンテナーは、デフォルトでビルド中に <<cdi-reference.adoc#remove_unused_beans,すべての未使用 Bean を削除>> しようとします。この最適化により、_フレームワークレベルでのデッドコード削除_ が可能になります。いくつかの特殊なケースでは、未使用の Bean を正しく識別することはできません。特に、Quarkus は `CDI.current()` 静的メソッドの使用をまだ検出できません。エクステンションは `UnremovableBeanBuildItem` を生成することで、誤検出の可能性を排除できます。

source: The container attempts to <<cdi-reference.adoc#remove_unused_beans,remove all unused beans>> during the build by default. This optimization allows for _framework-level dead code elimination_. In few special cases, it's not possible to correctly identify an unused bean. In particular, Quarkus is not able to detect the usage of the `CDI.current()` static method yet. Extensions can eliminate possible false positives by producing an `UnremovableBeanBuildItem`.
ja_jp: デフォルトで、コンテナーはビルド時に <<cdi-reference.adoc#remove_unused_beans,remove all unused beans>> を試行します。この最適化により、_フレームワークレベルでのデッドコードの排除_ が可能になります。いくつかの特殊なケースでは、未使用の Bean を正しく特定できません。特に、Quarkus はまだ `CDI.current()` 静的メソッドの使用を検出できません。エクステンションは、 `UnremovableBeanBuildItem` を生成することで、誤検出の可能性をなくすことができます。

source: The container attempts to remove all unused beans, interceptors and decorators during build by default. This optimization helps to minimize the amount of generated classes, thus conserving memory. However, Quarkus can't detect the programmatic lookup performed via the `CDI.current()` static method. Therefore, it is possible that a removal results in a false positive error, i.e. a bean is removed although it's actually used. In such cases, you'll notice a big warning in the log. Users and extension authors have several options <<eliminate_false_positives,how to eliminate false positives>>.
ja_jp: デフォルトでは、コンテナーはビルド中に未使用の Bean、インターセプター、デコレータをすべて削除しようとします。 この最適化により、生成されるクラスの量が最小限に抑えられ、メモリーが節約されます。 ただし、Quarkus は `CDI.current()` 静的メソッドを介して実行されるプログラムによる検索を検出できません。 したがって、削除によって誤検知エラーが発生する可能性があります。つまり、Bean は実際には使用されているにもかかわらず削除されることになります。 このような場合、ログに大きな警告が表示されます。 ユーザーとエクステンションの作者には <<eliminate_false_positives,how to eliminate false positives>> のオプションが複数あります。
